Documentation/Source/Photo_Lounge.org
#+TITLE: Photo Lounge Flow in Zambia
#+EMAIL: NELA.Percy@gmail.com
#+AUTHOR: Percy
#+DATE: January 2016
#+MACRO: DESCRIPTION Zambia is a piece of Conference Management Software.  This document is a "How To" guide assisting in the way of keeping track of Volunteer Hours for the Zambia FFF-branch instance for your conference.  This is still a work in progress.
#+DESCRIPTION: Zambia is a piece of Conference Management Software.  This document is a "How To" guide assisting in the way of keeping track of Volunteer Hours for the Zambia FFF-branch instance for your conference.  This is still a work in progress.
#+MACRO: KEYWORDS Zambia, Documentation, FFF branch
#+KEYWORDS: Zambia, Documentation, FFF branch
#+LANGUAGE: en
#+OPTIONS: \n:nil ^:nil timestamp:nil creator:nil H:3 num:3 toc:nil @:t ::nil |:t -:t todo:nil tasks:nil tags:nil <:t *:t author:t email:t skip:nil d:t f:t pri:t
#+STARTUP: fninline
#+SETUPFILE: "Headers/setupfile.org"
#+INCLUDE: "Headers/include.org"
#+TOC: headlines 3
#+LaTeX: \newpage
#+LaTeX: \pagenumbering{arabic}
* Introduction

  The Photo Lounge is a complex addition to Zambia that might not be
  used by all groups.  Some groups have used it, some have not.  Like
  all optional pieces, this can simply be untouched, and un-setup, and
  it will not bother anyone.  On the other hand, if you wish to use
  it, and have the ability to host something like a Photo Lounge or
  Art Gallery or the like, this is the right place to be doing so.

* Basic Setup

  Like all sub-sections of Zambia, to activate this you have to make
  sure you have a number of elements in your con setup in place.
** PhaseTypes

   A pair of PhaseTypes included in your con.  They would be "Photo
   Voting (17)" and "Photo Submissions (18)".

   Toggling the Photo Submission Phase, adds and removes the inclusion
   of the link to propose yourself as a photo submitter (a public
   page, which writes to a file, we'll get to that later) and your
   standard login to include the photo submitting words in the login
   string.  It also allows for the photo submission pages to be
   active.

   Toggling the Photo Voting Phase, adds and remvoes the links or
   access to voting for those who are of the right permissions to
   vote.
** PermissionRoles

   The three permission roles associated with the Photo Lounge are:
   + PhotoSub
   + PhotoRev
   + SuperPhotoRev

   PhotoSub is pretty straight-forward.  It is for those who are
   allowed to submit photos.  If they have no other role, then their
   login will take them directly to the Photo Submissions page.  If
   they do have other roles with the event (like presenting or
   volunteering) it will add the tab to their tab bar.  If they have
   other super-roles, then, to access the Photo Submission tab, they
   have to be under the "Participant View" section of the website to
   be able to submit their photos.

   PhotoRev is for those folks trusted with the job of reviewing
   photos.  It should open to the appropriate welcome page, and have
   the Photo Review tab available to them.  That leads to the voting
   section so they can express their opinions on what might or might
   not be included in the Photo Lounge.  There are still some quirks
   around voting, and one can game the system, by voting multiple
   times.  This will have to be coded around at some point in the
   future.

   SuperPhotoRev allows one to be able to select the voted on pictures
   for the lounge, give people permission to be PhotoRev and PhotoSub,
   and has StaffView.  This might want to become more limited, if the
   Super doesn't have other powers, to limit their access and review.
   Also the Super should be able to toggle on and off the Phases, but
   that also is still a work in progress.
** ConRoles

   There is one con role that works with this, but that is the host of
   the Photography Lounge, so not directly relevant to this document.
   See the document on Lounge Hosts.
