Documentation/Photo_Lounge.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Photo Lounge Flow in Zambia</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Percy" />
<meta  name="description" content="Zambia is a piece of Conference Management Software.  This document is a &quot;How To&quot; guide assisting in the way of keeping track of Volunteer Hours for the Zambia FFF-branch instance for your conference.  This is still a work in progress."
 />
<meta  name="keywords" content="Zambia, Documentation, FFF branch" />
</head>
<body>
<div id="content">
<h1 class="title">Photo Lounge Flow in Zambia</h1>
<p>
Zambia is a piece of Conference Management Software.  This document is a "How To" guide assisting in the way of keeping track of Volunteer Hours for the Zambia FFF-branch instance for your conference.  This is still a work in progress.
</p>
<p>
Photo Lounge Flow in Zambia
</p>
<p>
Percy &lt;NELA.Percy@gmail.com&gt;
</p>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Introduction</a></li>
<li><a href="#sec-2">2. Basic Setup</a>
<ul>
<li><a href="#sec-2-1">2.1. PhaseTypes</a></li>
<li><a href="#sec-2-2">2.2. PermissionRoles</a></li>
<li><a href="#sec-2-3">2.3. ConRoles</a></li>
</ul>
</li>
<li><a href="#sec-3">3. Scripts</a></li>
<li><a href="#sec-4">4. Files</a></li>
<li><a href="#sec-5">5. Flow</a></li>
<li><a href="#sec-6">6. Using the imagination software</a>
<ul>
<li><a href="#sec-6-1">6.1. File exerpt:</a></li>
</ul>
</li>
<li><a href="#sec-7">7. Convert VOB to mpeg/avi</a></li>
<li><a href="#sec-8">8. Load onto Devices</a></li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
The Photo Lounge is a complex addition to Zambia that might not be
used by all groups.  Some groups have used it, some have not.  Like
all optional pieces, this can simply be untouched, and un-setup, and
it will not bother anyone.  On the other hand, if you wish to use
it, and have the ability to host something like a Photo Lounge or
Art Gallery or the like, this is the right place to be doing so.
</p>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Basic Setup</h2>
<div class="outline-text-2" id="text-2">
<p>
Like all sub-sections of Zambia, to activate this you have to make
sure you have a number of elements in your con setup in place.
</p>
</div>
<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> PhaseTypes</h3>
<div class="outline-text-3" id="text-2-1">
<p>
A pair of PhaseTypes included in your con.  They would be "Photo
Voting (17)" and "Photo Submissions (18)".
</p>

<p>
Toggling the Photo Submission Phase, adds and removes the inclusion
of the link to propose yourself as a photo submitter (a public
page, which writes to a file, we'll get to that later) and your
standard login to include the photo submitting words in the login
string.  It also allows for the photo submission pages to be
active.
</p>

<p>
Toggling the Photo Voting Phase, adds and remvoes the links or
access to voting for those who are of the right permissions to
vote.
</p>
</div>
</div>

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> PermissionRoles</h3>
<div class="outline-text-3" id="text-2-2">
<p>
The three permission roles associated with the Photo Lounge are:
</p>
<ul class="org-ul">
<li>PhotoSub
</li>
<li>PhotoRev
</li>
<li>SuperPhotoRev
</li>
</ul>

<p>
PhotoSub is pretty straight-forward.  It is for those who are
allowed to submit photos.  If they have no other role, then their
login will take them directly to the Photo Submissions page.  If
they do have other roles with the event (like presenting or
volunteering) it will add the tab to their tab bar.  If they have
other super-roles, then, to access the Photo Submission tab, they
have to be under the "Participant View" section of the website to
be able to submit their photos.
</p>

<p>
PhotoRev is for those folks trusted with the job of reviewing
photos.  It should open to the appropriate welcome page, and have
the Photo Review tab available to them.  That leads to the voting
section so they can express their opinions on what might or might
not be included in the Photo Lounge.  There are still some quirks
around voting, and one can game the system, by voting multiple
times.  This will have to be coded around at some point in the
future.
</p>

<p>
SuperPhotoRev allows one to be able to select the voted on pictures
for the lounge, give people permission to be PhotoRev and PhotoSub,
and has StaffView.  This might want to become more limited, if the
Super doesn't have other powers, to limit their access and review.
Also the Super should be able to toggle on and off the Phases, but
that also is still a work in progress.
</p>
</div>
</div>

<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> ConRoles</h3>
<div class="outline-text-3" id="text-2-3">
<p>
There is one con role that works with this, but that is the host of
the Photography Lounge, so not directly relevant to this document.
See the document on Lounge Hosts.
</p>
</div>
</div>
</div>
