Documentation/Source/Photo_Lounge.tex
\documentclass[captions=tablesignature]{scrartcl}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
\usepackage{booktabs}
\usepackage[scaled]{beraserif}
\usepackage[scaled]{berasans}
\usepackage[scaled]{beramono}
\usepackage[usenames,dvipsnames]{color}
\usepackage{fancyhdr}
\usepackage{subfig}
\usepackage{listings}
\lstnewenvironment{common-lispcode}
{\lstset{language={HTML},basicstyle={\ttfamily\footnotesize},frame=single,breaklines=true}}
{}
\usepackage{paralist}
\let\itemize\compactitem
\let\description\compactdesc
\let\enumerate\compactenum
\usepackage[letterpaper,includeheadfoot,top=12.5mm,bottom=25mm,left=19mm,right=19mm]{geometry}
\pagestyle{fancy}
\setcounter{secnumdepth}{3}
\author{Percy\thanks{NELA.Percy@gmail.com}}
\date{January 2016}
\title{Photo Lounge Flow in Zambia}
\hypersetup{
  pdfkeywords={Zambia, Documentation, FFF branch},
  pdfsubject={Zambia is a piece of Conference Management Software.  This document is a "How To" guide assisting in the way of keeping track of Volunteer Hours for the Zambia FFF-branch instance for your conference.  This is still a work in progress.},
  pdfcreator={}}
\begin{document}

\maketitle
\pagenumbering{roman}
\thispagestyle{fancy}
\renewcommand{\headrulewidth}{0pt}
\renewcommand{\footrulewidth}{0pt}
\lhead{}
\rhead{}
\chead{}
\lfoot{}
\cfoot{}
\rfoot{}
\begin{abstract}
\vspace{5cm}
{\LARGE{\textbf{Abstract:\\}}}
Zambia is a piece of Conference Management Software.  This document is a "How To" guide assisting in the way of keeping track of Volunteer Hours for the Zambia FFF-branch instance for your conference.  This is still a work in progress.
\end{abstract}
\newpage
\renewcommand{\headrulewidth}{1pt}
\renewcommand{\footrulewidth}{1pt}
\chead{
Photo Lounge Flow in Zambia
}
\lfoot{
Percy <NELA.Percy@gmail.com>
}
\rfoot{\thepage}
\setcounter{tocdepth}{3}
\tableofcontents
\newpage
\pagenumbering{arabic}
\section{Introduction}
\label{sec-1}

The Photo Lounge is a complex addition to Zambia that might not be
used by all groups.  Some groups have used it, some have not.  Like
all optional pieces, this can simply be untouched, and un-setup, and
it will not bother anyone.  On the other hand, if you wish to use
it, and have the ability to host something like a Photo Lounge or
Art Gallery or the like, this is the right place to be doing so.
\section{Basic Setup}
\label{sec-2}

Like all sub-sections of Zambia, to activate this you have to make
sure you have a number of elements in your con setup in place.
\subsection{PhaseTypes}
\label{sec-2-1}
A pair of PhaseTypes included in your con.  They would be "Photo
Voting (17)" and "Photo Submissions (18)".

Toggling the Photo Submission Phase, adds and removes the inclusion
of the link to propose yourself as a photo submitter (a public
page, which writes to a file, we'll get to that later) and your
standard login to include the photo submitting words in the login
string.  It also allows for the photo submission pages to be
active.

Toggling the Photo Voting Phase, adds and remvoes the links or
access to voting for those who are of the right permissions to
vote.

\subsection{PermissionRoles}
\label{sec-2-2}
The three permission roles associated with the Photo Lounge are:
\begin{itemize}
\item PhotoSub
\item PhotoRev
\item SuperPhotoRev
\end{itemize}

PhotoSub is pretty straight-forward.  It is for those who are
allowed to submit photos.  If they have no other role, then their
login will take them directly to the Photo Submissions page.  If
they do have other roles with the event (like presenting or
volunteering) it will add the tab to their tab bar.  If they have
other super-roles, then, to access the Photo Submission tab, they
have to be under the "Participant View" section of the website to
be able to submit their photos.

PhotoRev is for those folks trusted with the job of reviewing
photos.  It should open to the appropriate welcome page, and have
the Photo Review tab available to them.  That leads to the voting
section so they can express their opinions on what might or might
not be included in the Photo Lounge.  There are still some quirks
around voting, and one can game the system, by voting multiple
times.  This will have to be coded around at some point in the
future.

SuperPhotoRev allows one to be able to select the voted on pictures
for the lounge, give people permission to be PhotoRev and PhotoSub,
and has StaffView.  This might want to become more limited, if the
Super doesn't have other powers, to limit their access and review.
Also the Super should be able to toggle on and off the Phases, but
that also is still a work in progress.

\subsection{ConRoles}
\label{sec-2-3}
There is one con role that works with this, but that is the host of
the Photography Lounge, so not directly relevant to this document.
See the document on Lounge Hosts.
