Documentation/Source/Photo_Lounge.org
* Scripts

  There are two scripts that are useful/necessary to the well-running
  of the Photo Lounge Flow.  They are:
  + create_thumbnails.sh
  + create_imagination_files.sh

  The create_thumbnails.sh script does just that.  Creates the
  thumbnail files.  It should be run periodically on a host that has
  access to the files, and can run convert from the imagemagick suite
  of programs to make the smaller, and much more useful, thumbnail
  files.

  The create_imagination_files.sh script is a script that will pull
  all the accepted files into a directory so that the imagination
  software from http://imagination.sourceforge.net/ can be used to
  create the slideshow.

  Both are fairly straight-forward and simple, but useful.
* Files

  There is a possiblity you would want to tweak the values at the top
  of the PhotoLoungeSubmit.php file.  They are:
  + $minwidth=1200;
  + $minheight=1200;
  + $maxwidth=30000;
  + $maxheight=30000;
  + $maxfilesize=6000000;

  and they map to, the minimum width, minumum height (both must
  be more than), maxumum width, maximum height (both must be less
  than) and maximum file size (must be less than).
* Flow

  + The flow starts when the call for Photo Submissions begins.
  + The SuperPhotoRev either asks for the phase to be set, or sets the
    phase to open, so that people might either submit, or apply to
    submit.
  + If self-service selection is enabled, then anyone who has been a
    Photo Submitter before can self-select into having those
    permissions again, on their own.
  + Anyone can be migrated to be allowed to be a Photo Submitter,
    again by the SuperPhotoRev.
  + If it is desired to just set everyone who has before been a Photo
    Submitter, to have that bit set for this event (replacing $conid
    with the current conid, of course):
#+begin_src html :exports both :results silent
    SELECT
        DISTINCT concat("INSERT INTO UserHasPermissionRole VALUES (",badgeid,",41,$conid);")
      FROM
          UserHasPermissionRole
      WHERE
        permroleid=41;
#+end_src
  + The PhotoSubs then submit photos at the [[../webpages/PhotoLoungeSubmit.php][PhotoLoungeSubmit.php]]
    page.
  + Once the photos are all submitted or the SuperPhotoRev is done
    soliciting them, that phase should be closed, and the Photo Voting
    phase should be initiated.
  + This would be a good time to have the create_thumbnails.sh script
    run.  That will make sure that all the thumbnails are in place,
    before the next step.
  + Folks that either have self-selected, if self-service has been
    enabled, or have been selected by the SuperPhotoRev may now go and
    vote on all the pictures at the [[../webpages/PhotoLoungePictures.php][PhotoLoungePictures.php]] page
    or by going directly to the individual artist selections at the
    [[../webpages/PhotoLoungeVote.php][PhotoLoungeVote.php]] page.
  + Once sufficient pictures have been voted on, the voting phase can
    close.
  + The selection process, of the pictures that are voted on have
    several steps, some of which can go in various orders, to be
    determined by the SuperPhotoRev.
  + View and select which of the voted-upon sets of pictures should be
    included into the lounge at the [[../webpages/PhotoLoungeCollectVotes.php][PhotoLoungeCollectVotes.php]] page.
  + Using the contact sheet, get in touch with all the appropriate
    PhotoSub folks to let them know what was selected from the
    [[../webpages/PhotoLoungeContactSheet.php][PhotoLoungeContactSheet.php]] page.
  + If there are any changes, they can be managed from:
    - the same contact sheet - [[../webpages/PhotoLoungeContactSheet.php][PhotoLoungeContactSheet.php]]
    - the view of the voted on pictures - [[../webpages/PhotoLoungeCollectVotes.php][PhotoLoungeCollectVotes.php]]
    - the report that also has the same information, without the
      possible confusion of changing what was selected -
      [[../webpages/genreport.php?reportname=picturesubmiswvote][genreport.php?reportname=picturesubmiswvote]]
  + Once the photos are all selected, this is a good time to run the
    create_imagination_files.sh script so that there is a directory to
    pull the appropriate files from, and create the slideshow from.
* Using the imagination software

  + Create a new slideshow: VOB/576 HD, no rescale, background=black
  + Import the images from the directory created by the
    create_imagination_files.sh script (probably
    Local/$conid/Photo_Lounge_Accepted)
  + Select all the images, and set the slide duration to 5.
  + Select all the images, and set a random transition, to be
    modified.
  + Select the speed (4)
  + Go through and fix all the transitions
  + Add the appropriate music
  + Export to a VOB file
