Documentation/Photo_Lounge.html

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Scripts</h2>
<div class="outline-text-2" id="text-3">
<p>
There are two scripts that are useful/necessary to the well-running
of the Photo Lounge Flow.  They are:
</p>
<ul class="org-ul">
<li>create_thumbnails.sh
</li>
<li>create_imagination_files.sh
</li>
</ul>

<p>
The create_thumbnails.sh script does just that.  Creates the
thumbnail files.  It should be run periodically on a host that has
access to the files, and can run convert from the imagemagick suite
of programs to make the smaller, and much more useful, thumbnail
files.
</p>

<p>
The create_imagination_files.sh script is a script that will pull
all the accepted files into a directory so that the imagination
software from <a href="http://imagination.sourceforge.net/">http://imagination.sourceforge.net/</a> can be used to
create the slideshow.
</p>

<p>
Both are fairly straight-forward and simple, but useful.
</p>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Files</h2>
<div class="outline-text-2" id="text-4">
<p>
There is a possiblity you would want to tweak the values at the top
of the PhotoLoungeSubmit.php file.  They are:
</p>
<ul class="org-ul">
<li>$minwidth=1200;
</li>
<li>$minheight=1200;
</li>
<li>$maxwidth=30000;
</li>
<li>$maxheight=30000;
</li>
<li>$maxfilesize=6000000;
</li>
</ul>

<p>
and they map to, the minimum width, minumum height (both must
be more than), maxumum width, maximum height (both must be less
than) and maximum file size (must be less than).
</p>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Flow</h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li>The flow starts when the call for Photo Submissions begins.
</li>
<li>The SuperPhotoRev either asks for the phase to be set, or sets the
phase to open, so that people might either submit, or apply to
submit.
</li>
<li>If self-service selection is enabled, then anyone who has been a
Photo Submitter before can self-select into having those
permissions again, on their own.
</li>
<li>Anyone can be migrated to be allowed to be a Photo Submitter,
again by the SuperPhotoRev.
</li>
<li>If it is desired to just set everyone who has before been a Photo
Submitter, to have that bit set for this event (replacing $conid
with the current conid, of course):
</li>
</ul>
<div class="org-src-container">

<pre class="src src-html">SELECT
    DISTINCT concat("INSERT INTO UserHasPermissionRole VALUES (",badgeid,",41,$conid);")
  FROM
      UserHasPermissionRole
  WHERE
    permroleid=41;
</pre>
</div>
<ul class="org-ul">
<li>The PhotoSubs then submit photos:
</li>
</ul>
<div class="org-src-container">

<pre class="src src-html">YourWebPath/webpages/PhotoLoungeSubmit.php
</pre>
</div>
<ul class="org-ul">
<li>Once the photos are all submitted or the SuperPhotoRev is done
soliciting them, that phase should be closed, and the Photo Voting
phase should be initiated.
</li>
<li>This would be a good time to have the create_thumbnails.sh script
run.  That will make sure that all the thumbnails are in place,
before the next step.
</li>
<li>Folks that either have self-selected, if self-service has been
enabled, or have been selected by the SuperPhotoRev may now go and
vote on all the pictures:
</li>
</ul>
<div class="org-src-container">

<pre class="src src-html">YourWebPath/webpages/PhotoLoungePictures.php
</pre>
</div>
<p>
or by going directly to the individual artist selections:
</p>
<div class="org-src-container">

<pre class="src src-html">YourWebPath/webpages/PhotoLoungeVote.php
</pre>
</div>
<ul class="org-ul">
<li>Once sufficient pictures have been voted on, the voting phase can
close.
</li>
<li>The selection process, of the pictures that are voted on have
several steps, some of which can go in various orders, to be
determined by the SuperPhotoRev.
</li>
<li>View and select which of the voted-upon sets of pictures should be
included into the lounge:
</li>
</ul>
<div class="org-src-container">

<pre class="src src-html">YourWebPath/webpages/PhotoLoungeCollectVotes.php
</pre>
</div>
<ul class="org-ul">
<li>Using the contact sheet, get in touch with all the appropriate
PhotoSub folks to let them know what was selected.
</li>
</ul>
<div class="org-src-container">

<pre class="src src-html">YourWebPath/webpages/PhotoLoungeContactSheet.php
</pre>
</div>
<ul class="org-ul">
<li>If there are any changes, they can be managed from the contact
sheet:
</li>
</ul>
<div class="org-src-container">

<pre class="src src-html">YourWebPath/webpages/PhotoLoungeContactSheet.php
</pre>
</div>
<p>
the view of the voted on pictures:
</p>
<div class="org-src-container">

<pre class="src src-html">YourWebPath/webpages/PhotoLoungeCollectVotes.php
</pre>
</div>
<p>
or the report that also has the same information, without the
possible confusion of changing what was selected:
</p>
<div class="org-src-container">

<pre class="src src-html">YourWebPath/webpages/genreport.php?reportname=picturesubmiswvote
</pre>
</div>
<ul class="org-ul">
<li>Once the photos are all selected, this is a good time to run the
create_imagination_files.sh script so that there is a directory to
pull the appropriate files from, and create the slideshow from.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Using the imagination software</h2>
<div class="outline-text-2" id="text-6">
<ul class="org-ul">
<li>Create a new slideshow: VOB/576 HD, no rescale, background=black
</li>
<li>Import the images from the directory created by the
create_imagination_files.sh script (probably
Local/$conid/Photo_Lounge_Accepted)
</li>
<li>Select all the images, and set the slide duration to 5.
</li>
<li>Select all the images, and set a random transition, to be
modified.
</li>
<li>Select the speed (4)
</li>
<li>Go through and fix all the transitions
</li>
<li>Add the appropriate music
</li>
<li>Export to a VOB file
</li>
</ul>
</div>
