Documentation/Source/Photo_Lounge.tex

\section{Scripts}
\label{sec-3}

There are two scripts that are useful/necessary to the well-running
of the Photo Lounge Flow.  They are:
\begin{itemize}
\item create\_thumbnails.sh
\item create\_imagination\_files.sh
\end{itemize}

The create\_thumbnails.sh script does just that.  Creates the
thumbnail files.  It should be run periodically on a host that has
access to the files, and can run convert from the imagemagick suite
of programs to make the smaller, and much more useful, thumbnail
files.

The create\_imagination\_files.sh script is a script that will pull
all the accepted files into a directory so that the imagination
software from \url{http://imagination.sourceforge.net/} can be used to
create the slideshow.

Both are fairly straight-forward and simple, but useful.

\section{Files}
\label{sec-4}
There is a possiblity you would want to tweak the values at the top
of the PhotoLoungeSubmit.php file.  They are:
\begin{itemize}
\item \$minwidth=1200;
\item \$minheight=1200;
\item \$maxwidth=30000;
\item \$maxheight=30000;
\item \$maxfilesize=6000000;
\end{itemize}

and they map to, the minimum width, minumum height (both must
be more than), maxumum width, maximum height (both must be less
than) and maximum file size (must be less than).

\section{Flow}
\label{sec-5}
\begin{itemize}
\item The flow starts when the call for Photo Submissions begins.
\item The SuperPhotoRev either asks for the phase to be set, or sets the
phase to open, so that people might either submit, or apply to
submit.
\item If self-service selection is enabled, then anyone who has been a
Photo Submitter before can self-select into having those
permissions again, on their own.
\item Anyone can be migrated to be allowed to be a Photo Submitter,
again by the SuperPhotoRev.
\item If it is desired to just set everyone who has before been a Photo
Submitter, to have that bit set for this event (replacing \$conid
with the current conid, of course):
\end{itemize}
\begin{verbatim}
SELECT
    DISTINCT concat("INSERT INTO UserHasPermissionRole VALUES (",badgeid,",41,$conid);")
  FROM
      UserHasPermissionRole
  WHERE
    permroleid=41;
\end{verbatim}
\begin{itemize}
\item The PhotoSubs then submit photos:
\end{itemize}
\begin{verbatim}
YourWebPath/webpages/PhotoLoungeSubmit.php
\end{verbatim}
\begin{itemize}
\item Once the photos are all submitted or the SuperPhotoRev is done
soliciting them, that phase should be closed, and the Photo Voting
phase should be initiated.
\item This would be a good time to have the create\_thumbnails.sh script
run.  That will make sure that all the thumbnails are in place,
before the next step.
\item Folks that either have self-selected, if self-service has been
enabled, or have been selected by the SuperPhotoRev may now go and
vote on all the pictures:
\end{itemize}
\begin{verbatim}
YourWebPath/webpages/PhotoLoungePictures.php
\end{verbatim}
or by going directly to the individual artist selections:
\begin{verbatim}
YourWebPath/webpages/PhotoLoungeVote.php
\end{verbatim}
\begin{itemize}
\item Once sufficient pictures have been voted on, the voting phase can
close.
\item The selection process, of the pictures that are voted on have
several steps, some of which can go in various orders, to be
determined by the SuperPhotoRev.
\item View and select which of the voted-upon sets of pictures should be
included into the lounge:
\end{itemize}
\begin{verbatim}
YourWebPath/webpages/PhotoLoungeCollectVotes.php
\end{verbatim}
\begin{itemize}
\item Using the contact sheet, get in touch with all the appropriate
PhotoSub folks to let them know what was selected.
\end{itemize}
\begin{verbatim}
YourWebPath/webpages/PhotoLoungeContactSheet.php
\end{verbatim}
\begin{itemize}
\item If there are any changes, they can be managed from the contact
sheet:
\end{itemize}
\begin{verbatim}
YourWebPath/webpages/PhotoLoungeContactSheet.php
\end{verbatim}
the view of the voted on pictures:
\begin{verbatim}
YourWebPath/webpages/PhotoLoungeCollectVotes.php
\end{verbatim}
or the report that also has the same information, without the
possible confusion of changing what was selected:
\begin{verbatim}
YourWebPath/webpages/genreport.php?reportname=picturesubmiswvote
\end{verbatim}
\begin{itemize}
\item Once the photos are all selected, this is a good time to run the
create\_imagination\_files.sh script so that there is a directory to
pull the appropriate files from, and create the slideshow from.
\end{itemize}

\section{Using the imagination software}
\label{sec-6}
\begin{itemize}
\item Create a new slideshow: VOB/576 HD, no rescale, background=black
\item Import the images from the directory created by the
create\_imagination\_files.sh script (probably
Local/\$conid/Photo\_Lounge\_Accepted)
\item Select all the images, and set the slide duration to 5.
\item Select all the images, and set a random transition, to be
modified.
\item Select the speed (4)
\end{itemize}
