Documentation/Source/Photo_Lounge.org
** File exerpt:

#+begin_src html :exports both :results silent
[slideshow settings]
video format=576
background color=0;0;0;
distort images=false
number of slides=75

[slide 1]
filename=/home/dkap/hcarperoot/Downloads/PhotoLounge/Anthelian_1_mg_7182a.jpg
angle=0
duration=5
transition_id=13
speed=4
no_points=0
anim id=0
anim duration=1
text pos=4
placing=0
font=Sans 12
font color=0;0;0;1;
font bgcolor=1;1;1;1;
#+end_src
* Convert VOB to mpeg/avi

  + ffmpeg -i FFF??_Photo_Lounge.vob -f avi -c:v mpeg4 -b:v 800k -g 300 -bf 2 -c:a libmp3lame -b:a 128k FFF??_Photo_Lounge.avi
  + cp FFF??_Photo_Lounge.vob FFF??_Photo_Lounge.mpeg
* Load onto Devices

  + Thumb Drives:  Pictures into Pictures, only the mpeg in Movies
  + Pi Devices: Everthing into local Pictures, mpeg into sub Movie diretory in Pictures.
