Documentation/Photo_Lounge.html
<div id="outline-container-sec-6-1" class="outline-3">
<h3 id="sec-6-1"><span class="section-number-3">6.1</span> File exerpt:</h3>
<div class="outline-text-3" id="text-6-1">
<div class="org-src-container">

<pre class="src src-html">[slideshow settings]
video format=576
background color=0;0;0;
distort images=false
number of slides=75

[slide 1]
filename=/home/dkap/hcarperoot/Downloads/PhotoLounge/Anthelian_1_mg_7182a.jpg
angle=0
duration=5
transition_id=13
speed=4
no_points=0
anim id=0
anim duration=1
text pos=4
placing=0
font=Sans 12
font color=0;0;0;1;
font bgcolor=1;1;1;1;
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> Convert VOB to mpeg/avi</h2>
<div class="outline-text-2" id="text-7">
<ul class="org-ul">
<li>ffmpeg -i FFF??_Photo_Lounge.vob -f avi -c:v mpeg4 -b:v 800k -g 300 -bf 2 -c:a libmp3lame -b:a 128k FFF??_Photo_Lounge.avi
</li>
<li>cp FFF??_Photo_Lounge.vob FFF??_Photo_Lounge.mpeg
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> Load onto Devices</h2>
<div class="outline-text-2" id="text-8">
<ul class="org-ul">
<li>Thumb Drives:  Pictures into Pictures, only the mpeg in Movies
</li>
<li>Pi Devices: Everthing into local Pictures, mpeg into sub Movie diretory in Pictures.
</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: January 2016</p>
<p class="author">Author: Percy</p>
<p class="email">Email: <a href="mailto:NELA.Percy@gmail.com">NELA.Percy@gmail.com</a></p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>