Documentation/Source/Photo_Lounge.tex
\subsection{File exerpt:}
\label{sec-6-1}
\begin{verbatim}
[slideshow settings]
video format=576
background color=0;0;0;
distort images=false
number of slides=75

[slide 1]
filename=/home/dkap/hcarperoot/Downloads/PhotoLounge/Anthelian_1_mg_7182a.jpg
angle=0
duration=5
transition_id=13
speed=4
no_points=0
anim id=0
anim duration=1
text pos=4
placing=0
font=Sans 12
font color=0;0;0;1;
font bgcolor=1;1;1;1;
\end{verbatim}
\end{document}